{"_name_or_path": "bert-base-uncased", "architectures": ["BertForTokenClassification"], "attention_probs_dropout_prob": 0.1, "classifier_dropout": null, "gradient_checkpointing": false, "hidden_act": "gelu", "hidden_dropout_prob": 0.1, "hidden_size": 768, "id2label": {"0": "O", "1": "B-TOL", "2": "I-TOL", "3": "B-HDG", "4": "I-HDG", "5": "B-TAR", "6": "I-TAR"}, "initializer_range": 0.02, "intermediate_size": 3072, "label2id": {"O": "0", "B-TOL": "1", "I-TOL": "2", "B-HDG": "3", "I-HDG": "4", "B-TAR": "5", "I-TAR": "6"}, "layer_norm_eps": 1e-12, "max_position_embeddings": 512, "model_type": "bert", "num_attention_heads": 12, "num_hidden_layers": 12, "pad_token_id": 0, "position_embedding_type": "absolute", "torch_dtype": "float32", "transformers_version": "4.31.0", "type_vocab_size": 2, "use_cache": true, "vocab_size": 30522}